zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl704x-pinctrl.h
/* gpio20_uart0_tx */
#define GPIO20_UART0_TX \
	BFLB_PINMUX(20, uart0, tx, periph)

/* gpio20_uart0_rx */
#define GPIO20_UART0_RX \
	BFLB_PINMUX(20, uart0, rx, periph)

/* gpio20_uart1_rts */
#define GPIO20_UART1_RTS \
	BFLB_PINMUX(20, uart1, rts, periph)

/* gpio20_uart1_cts */
#define GPIO20_UART1_CTS \
	BFLB_PINMUX(20, uart1, cts, periph)

/* gpio20_uart1_tx */
#define GPIO20_UART1_TX \
	BFLB_PINMUX(20, uart1, tx, periph)

/* gpio20_uart1_rx */
#define GPIO20_UART1_RX \
	BFLB_PINMUX(20, uart1, rx, periph)

/* gpio20_pwm_ch0 */
#define GPIO20_PWM_CH0 \
	BFLB_PINMUX(20, pwm, ch0, periph)

/* gpio20_cam_pix_dat7 */
#define GPIO20_CAM_PIX_DAT7 \
	BFLB_PINMUX(20, cam, pix_dat7, periph)

/* gpio20_jtag_tms */
#define GPIO20_JTAG_TMS \
	BFLB_PINMUX(20, jtag, tms, periph)

/* gpio20_fem_gpio0 */
#define GPIO20_FEM_GPIO0 \
	BFLB_PINMUX(20, fem, gpio0, periph)

/* gpio20_mii_rxerr */
#define GPIO20_MII_RXERR \
	BFLB_PINMUX(20, mii, rxerr, periph)

/* gpio20_qdec0_led */
#define GPIO20_QDEC0_LED \
	BFLB_PINMUX(20, qdec0, led, periph)

/* gpio20_adc_ch10 */
#define GPIO20_ADC_CH10 \
	BFLB_PINMUX(20, adc, ch10, analog)

/* gpio21_clock_out1_i2s_ref */
#define GPIO21_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(21, clock_out1, i2s_ref, periph)

/* gpio21_clock_out1_aupll */
#define GPIO21_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(21, clock_out1, aupll, periph)

/* gpio21_clock_out1_xtal */
#define GPIO21_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(21, clock_out1, xtal, periph)

/* gpio21_sf1_clk */
#define GPIO21_SF1_CLK \
	BFLB_PINMUX(21, sf1, clk, periph)

/* gpio21_i2s_fs */
#define GPIO21_I2S_FS \
	BFLB_PINMUX(21, i2s, fs, periph)

/* gpio21_spi_miso */
#define GPIO21_SPI_MISO \
	BFLB_PINMUX(21, spi, miso, periph)

/* gpio21_i2c_sda */
#define GPIO21_I2C_SDA \
	BFLB_PINMUX(21, i2c, sda, periph)

/* gpio21_uart0_rts */
#define GPIO21_UART0_RTS \
	BFLB_PINMUX(21, uart0, rts, periph)

/* gpio21_uart0_cts */
#define GPIO21_UART0_CTS \
	BFLB_PINMUX(21, uart0, cts, periph)

/* gpio21_uart0_tx */
#define GPIO21_UART0_TX \
	BFLB_PINMUX(21, uart0, tx, periph)

/* gpio21_uart0_rx */
#define GPIO21_UART0_RX \
	BFLB_PINMUX(21, uart0, rx, periph)

/* gpio21_uart1_rts */
#define GPIO21_UART1_RTS \
	BFLB_PINMUX(21, uart1, rts, periph)

/* gpio21_uart1_cts */
#define GPIO21_UART1_CTS \
	BFLB_PINMUX(21, uart1, cts, periph)

/* gpio21_uart1_tx */
#define GPIO21_UART1_TX \
	BFLB_PINMUX(21, uart1, tx, periph)

/* gpio21_uart1_rx */
#define GPIO21_UART1_RX \
	BFLB_PINMUX(21, uart1, rx, periph)

/* gpio21_pwm_ch1 */
#define GPIO21_PWM_CH1 \
	BFLB_PINMUX(21, pwm, ch1, periph)

/* gpio21_jtag_tdi */
#define GPIO21_JTAG_TDI \
	BFLB_PINMUX(21, jtag, tdi, periph)

/* gpio21_fem_gpio1 */
#define GPIO21_FEM_GPIO1 \
	BFLB_PINMUX(21, fem, gpio1, periph)

/* gpio21_mii_tx_en */
#define GPIO21_MII_TX_EN \
	BFLB_PINMUX(21, mii, tx_en, periph)

/* gpio21_qdec1_led */
#define GPIO21_QDEC1_LED \
	BFLB_PINMUX(21, qdec1, led, periph)

/* gpio21_adc_ch11 */
#define GPIO21_ADC_CH11 \
	BFLB_PINMUX(21, adc, ch11, analog)

/* gpio22_clock_out0_i2s_ref */
#define GPIO22_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(22, clock_out0, i2s_ref, periph)

/* gpio22_clock_out0_aupll */
#define GPIO22_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(22, clock_out0, aupll, periph)

/* gpio22_clock_out0_xtal */
#define GPIO22_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(22, clock_out0, xtal, periph)

/* gpio22_sf1_d2 */
#define GPIO22_SF1_D2 \
	BFLB_PINMUX(22, sf1, d2, periph)

/* gpio22_i2s_do */
#define GPIO22_I2S_DO \
	BFLB_PINMUX(22, i2s, do, periph)

/* gpio22_spi_ss */
#define GPIO22_SPI_SS \
	BFLB_PINMUX(22, spi, ss, periph)

/* gpio22_i2c_scl */
#define GPIO22_I2C_SCL \
	BFLB_PINMUX(22, i2c, scl, periph)

/* gpio22_uart0_rts */
#define GPIO22_UART0_RTS \
	BFLB_PINMUX(22, uart0, rts, periph)

/* gpio22_uart0_cts */
#define GPIO22_UART0_CTS \
	BFLB_PINMUX(22, uart0, cts, periph)

/* gpio22_uart0_tx */
#define GPIO22_UART0_TX \
	BFLB_PINMUX(22, uart0, tx, periph)

/* gpio22_uart0_rx */
#define GPIO22_UART0_RX \
	BFLB_PINMUX(22, uart0, rx, periph)

/* gpio22_uart1_rts */
#define GPIO22_UART1_RTS \
	BFLB_PINMUX(22, uart1, rts, periph)

/* gpio22_uart1_cts */
#define GPIO22_UART1_CTS \
	BFLB_PINMUX(22, uart1, cts, periph)

/* gpio22_uart1_tx */
#define GPIO22_UART1_TX \
	BFLB_PINMUX(22, uart1, tx, periph)

/* gpio22_uart1_rx */
#define GPIO22_UART1_RX \
	BFLB_PINMUX(22, uart1, rx, periph)

/* gpio22_pwm_ch2 */
#define GPIO22_PWM_CH2 \
	BFLB_PINMUX(22, pwm, ch2, periph)

/* gpio22_jtag_tck */
#define GPIO22_JTAG_TCK \
	BFLB_PINMUX(22, jtag, tck, periph)

/* gpio22_fem_gpio2 */
#define GPIO22_FEM_GPIO2 \
	BFLB_PINMUX(22, fem, gpio2, periph)

/* gpio22_mii_rx_dv */
#define GPIO22_MII_RX_DV \
	BFLB_PINMUX(22, mii, rx_dv, periph)

/* gpio22_qdec1_b */
#define GPIO22_QDEC1_B \
	BFLB_PINMUX(22, qdec1, b, periph)

/* gpio22_ir_tx */
#define GPIO22_IR_TX \
	BFLB_PINMUX(22, ir, tx, analog)

/* gpio23_clock_out1_i2s_ref */
#define GPIO23_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(23, clock_out1, i2s_ref, periph)

/* gpio23_clock_out1_aupll */
#define GPIO23_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(23, clock_out1, aupll, periph)

/* gpio23_clock_out1_xtal */
#define GPIO23_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(23, clock_out1, xtal, periph)

/* gpio23_sf2_d2 */
#define GPIO23_SF2_D2 \
	BFLB_PINMUX(23, sf2, d2, periph)

/* gpio23_sf2_cs */
#define GPIO23_SF2_CS \
	BFLB_PINMUX(23, sf2, cs, periph)

/* gpio23_sf3_cs2 */
#define GPIO23_SF3_CS2 \
	BFLB_PINMUX(23, sf3, cs2, periph)

/* gpio23_i2s_di */
#define GPIO23_I2S_DI \
	BFLB_PINMUX(23, i2s, di, periph)

/* gpio23_spi_sclk */
#define GPIO23_SPI_SCLK \
	BFLB_PINMUX(23, spi, sclk, periph)

/* gpio23_i2c_sda */
#define GPIO23_I2C_SDA \
	BFLB_PINMUX(23, i2c, sda, periph)

/* gpio23_uart0_rts */
#define GPIO23_UART0_RTS \
	BFLB_PINMUX(23, uart0, rts, periph)

/* gpio23_uart0_cts */
#define GPIO23_UART0_CTS \
	BFLB_PINMUX(23, uart0, cts, periph)

/* gpio23_uart0_tx */
#define GPIO23_UART0_TX \
	BFLB_PINMUX(23, uart0, tx, periph)

/* gpio23_uart0_rx */
#define GPIO23_UART0_RX \
	BFLB_PINMUX(23, uart0, rx, periph)

/* gpio23_uart1_rts */
#define GPIO23_UART1_RTS \
	BFLB_PINMUX(23, uart1, rts, periph)

