zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl704x-pinctrl.h
/* gpio23_uart1_cts */
#define GPIO23_UART1_CTS \
	BFLB_PINMUX(23, uart1, cts, periph)

/* gpio23_uart1_tx */
#define GPIO23_UART1_TX \
	BFLB_PINMUX(23, uart1, tx, periph)

/* gpio23_uart1_rx */
#define GPIO23_UART1_RX \
	BFLB_PINMUX(23, uart1, rx, periph)

/* gpio23_pwm_ch3 */
#define GPIO23_PWM_CH3 \
	BFLB_PINMUX(23, pwm, ch3, periph)

/* gpio23_cam_pix_dat4 */
#define GPIO23_CAM_PIX_DAT4 \
	BFLB_PINMUX(23, cam, pix_dat4, periph)

/* gpio23_jtag_tdo */
#define GPIO23_JTAG_TDO \
	BFLB_PINMUX(23, jtag, tdo, periph)

/* gpio23_fem_gpio3 */
#define GPIO23_FEM_GPIO3 \
	BFLB_PINMUX(23, fem, gpio3, periph)

/* gpio23_qdec1_led */
#define GPIO23_QDEC1_LED \
	BFLB_PINMUX(23, qdec1, led, periph)

/* gpio23_ir_tx */
#define GPIO23_IR_TX \
	BFLB_PINMUX(23, ir, tx, analog)

/* gpio24_clock_out0_i2s_ref */
#define GPIO24_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(24, clock_out0, i2s_ref, periph)

/* gpio24_clock_out0_aupll */
#define GPIO24_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(24, clock_out0, aupll, periph)

/* gpio24_clock_out0_xtal */
#define GPIO24_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(24, clock_out0, xtal, periph)

/* gpio24_sf2_d1 */
#define GPIO24_SF2_D1 \
	BFLB_PINMUX(24, sf2, d1, periph)

/* gpio24_i2s_blck */
#define GPIO24_I2S_BLCK \
	BFLB_PINMUX(24, i2s, blck, periph)

/* gpio24_spi_mosi */
#define GPIO24_SPI_MOSI \
	BFLB_PINMUX(24, spi, mosi, periph)

/* gpio24_i2c_scl */
#define GPIO24_I2C_SCL \
	BFLB_PINMUX(24, i2c, scl, periph)

/* gpio24_uart0_rts */
#define GPIO24_UART0_RTS \
	BFLB_PINMUX(24, uart0, rts, periph)

/* gpio24_uart0_cts */
#define GPIO24_UART0_CTS \
	BFLB_PINMUX(24, uart0, cts, periph)

/* gpio24_uart0_tx */
#define GPIO24_UART0_TX \
	BFLB_PINMUX(24, uart0, tx, periph)

/* gpio24_uart0_rx */
#define GPIO24_UART0_RX \
	BFLB_PINMUX(24, uart0, rx, periph)

/* gpio24_uart1_rts */
#define GPIO24_UART1_RTS \
	BFLB_PINMUX(24, uart1, rts, periph)

/* gpio24_uart1_cts */
#define GPIO24_UART1_CTS \
	BFLB_PINMUX(24, uart1, cts, periph)

/* gpio24_uart1_tx */
#define GPIO24_UART1_TX \
	BFLB_PINMUX(24, uart1, tx, periph)

/* gpio24_uart1_rx */
#define GPIO24_UART1_RX \
	BFLB_PINMUX(24, uart1, rx, periph)

/* gpio24_pwm_ch4 */
#define GPIO24_PWM_CH4 \
	BFLB_PINMUX(24, pwm, ch4, periph)

/* gpio24_cam_pix_dat5 */
#define GPIO24_CAM_PIX_DAT5 \
	BFLB_PINMUX(24, cam, pix_dat5, periph)

/* gpio24_jtag_tms */
#define GPIO24_JTAG_TMS \
	BFLB_PINMUX(24, jtag, tms, periph)

/* gpio24_fem_gpio4 */
#define GPIO24_FEM_GPIO4 \
	BFLB_PINMUX(24, fem, gpio4, periph)

/* gpio24_mii_mdc */
#define GPIO24_MII_MDC \
	BFLB_PINMUX(24, mii, mdc, periph)

/* gpio24_qdec2_a */
#define GPIO24_QDEC2_A \
	BFLB_PINMUX(24, qdec2, a, periph)

/* gpio25_clock_out1_i2s_ref */
#define GPIO25_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(25, clock_out1, i2s_ref, periph)

/* gpio25_clock_out1_aupll */
#define GPIO25_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(25, clock_out1, aupll, periph)

/* gpio25_clock_out1_xtal */
#define GPIO25_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(25, clock_out1, xtal, periph)

/* gpio25_sf2_cs */
#define GPIO25_SF2_CS \
	BFLB_PINMUX(25, sf2, cs, periph)

/* gpio25_sf2_d2 */
#define GPIO25_SF2_D2 \
	BFLB_PINMUX(25, sf2, d2, periph)

/* gpio25_i2s_fs */
#define GPIO25_I2S_FS \
	BFLB_PINMUX(25, i2s, fs, periph)

/* gpio25_spi_miso */
#define GPIO25_SPI_MISO \
	BFLB_PINMUX(25, spi, miso, periph)

/* gpio25_i2c_sda */
#define GPIO25_I2C_SDA \
	BFLB_PINMUX(25, i2c, sda, periph)

/* gpio25_uart0_rts */
#define GPIO25_UART0_RTS \
	BFLB_PINMUX(25, uart0, rts, periph)

/* gpio25_uart0_cts */
#define GPIO25_UART0_CTS \
	BFLB_PINMUX(25, uart0, cts, periph)

/* gpio25_uart0_tx */
#define GPIO25_UART0_TX \
	BFLB_PINMUX(25, uart0, tx, periph)

/* gpio25_uart0_rx */
#define GPIO25_UART0_RX \
	BFLB_PINMUX(25, uart0, rx, periph)

/* gpio25_uart1_rts */
#define GPIO25_UART1_RTS \
	BFLB_PINMUX(25, uart1, rts, periph)

/* gpio25_uart1_cts */
#define GPIO25_UART1_CTS \
	BFLB_PINMUX(25, uart1, cts, periph)

/* gpio25_uart1_tx */
#define GPIO25_UART1_TX \
	BFLB_PINMUX(25, uart1, tx, periph)

/* gpio25_uart1_rx */
#define GPIO25_UART1_RX \
	BFLB_PINMUX(25, uart1, rx, periph)

/* gpio25_pwm_ch0 */
#define GPIO25_PWM_CH0 \
	BFLB_PINMUX(25, pwm, ch0, periph)

/* gpio25_cam_pix_dat6 */
#define GPIO25_CAM_PIX_DAT6 \
	BFLB_PINMUX(25, cam, pix_dat6, periph)

/* gpio25_jtag_tdi */
#define GPIO25_JTAG_TDI \
	BFLB_PINMUX(25, jtag, tdi, periph)

/* gpio25_fem_gpio0 */
#define GPIO25_FEM_GPIO0 \
	BFLB_PINMUX(25, fem, gpio0, periph)

/* gpio25_mii_mdio */
#define GPIO25_MII_MDIO \
	BFLB_PINMUX(25, mii, mdio, periph)

/* gpio25_qdec2_b */
#define GPIO25_QDEC2_B \
	BFLB_PINMUX(25, qdec2, b, periph)

/* gpio26_clock_out0_i2s_ref */
#define GPIO26_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(26, clock_out0, i2s_ref, periph)

/* gpio26_clock_out0_aupll */
#define GPIO26_CLOCK_OUT0_AUPLL \
	BFLB_PINMUX(26, clock_out0, aupll, periph)

/* gpio26_clock_out0_xtal */
#define GPIO26_CLOCK_OUT0_XTAL \
	BFLB_PINMUX(26, clock_out0, xtal, periph)

/* gpio26_sf2_d3 */
#define GPIO26_SF2_D3 \
	BFLB_PINMUX(26, sf2, d3, periph)

/* gpio26_sf2_d0 */
#define GPIO26_SF2_D0 \
	BFLB_PINMUX(26, sf2, d0, periph)

/* gpio26_i2s_do */
#define GPIO26_I2S_DO \
	BFLB_PINMUX(26, i2s, do, periph)

/* gpio26_spi_ss */
#define GPIO26_SPI_SS \
	BFLB_PINMUX(26, spi, ss, periph)

/* gpio26_i2c_scl */
#define GPIO26_I2C_SCL \
	BFLB_PINMUX(26, i2c, scl, periph)

/* gpio26_uart0_rts */
#define GPIO26_UART0_RTS \
	BFLB_PINMUX(26, uart0, rts, periph)

/* gpio26_uart0_cts */
#define GPIO26_UART0_CTS \
	BFLB_PINMUX(26, uart0, cts, periph)

/* gpio26_uart0_tx */
#define GPIO26_UART0_TX \
	BFLB_PINMUX(26, uart0, tx, periph)

/* gpio26_uart0_rx */
#define GPIO26_UART0_RX \
	BFLB_PINMUX(26, uart0, rx, periph)

/* gpio26_uart1_rts */
#define GPIO26_UART1_RTS \
	BFLB_PINMUX(26, uart1, rts, periph)

/* gpio26_uart1_cts */
#define GPIO26_UART1_CTS \
	BFLB_PINMUX(26, uart1, cts, periph)

/* gpio26_uart1_tx */
#define GPIO26_UART1_TX \
	BFLB_PINMUX(26, uart1, tx, periph)

/* gpio26_uart1_rx */
#define GPIO26_UART1_RX \
	BFLB_PINMUX(26, uart1, rx, periph)

/* gpio26_pwm_ch1 */
#define GPIO26_PWM_CH1 \
	BFLB_PINMUX(26, pwm, ch1, periph)

/* gpio26_cam_pix_dat7 */
#define GPIO26_CAM_PIX_DAT7 \
	BFLB_PINMUX(26, cam, pix_dat7, periph)

/* gpio26_jtag_tck */
#define GPIO26_JTAG_TCK \
	BFLB_PINMUX(26, jtag, tck, periph)

/* gpio26_fem_gpio1 */
#define GPIO26_FEM_GPIO1 \
	BFLB_PINMUX(26, fem, gpio1, periph)

/* gpio26_mii_rxerr */
#define GPIO26_MII_RXERR \
	BFLB_PINMUX(26, mii, rxerr, periph)

/* gpio26_qdec2_led */
#define GPIO26_QDEC2_LED \
	BFLB_PINMUX(26, qdec2, led, periph)

/* gpio27_clock_out1_i2s_ref */
#define GPIO27_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(27, clock_out1, i2s_ref, periph)

/* gpio27_clock_out1_aupll */
#define GPIO27_CLOCK_OUT1_AUPLL \
	BFLB_PINMUX(27, clock_out1, aupll, periph)

/* gpio27_clock_out1_xtal */
#define GPIO27_CLOCK_OUT1_XTAL \
	BFLB_PINMUX(27, clock_out1, xtal, periph)

/* gpio27_sf2_clk */
#define GPIO27_SF2_CLK \
	BFLB_PINMUX(27, sf2, clk, periph)

/* gpio27_i2s_di */
#define GPIO27_I2S_DI \
	BFLB_PINMUX(27, i2s, di, periph)

/* gpio27_spi_sclk */
#define GPIO27_SPI_SCLK \
	BFLB_PINMUX(27, spi, sclk, periph)

